{
    "students": [
      {
        "id": 1,
        "name": "Alana Eve Lacy",
        "tags": ["identity", "logo"],
        "title": "Western Girl In Japan",
        "image": "Press/alana1.png",
        "image2":"Press/alana2.png",
        "year": "2023",
        "desc": "I want to create this piece of design to immortalise in hard copy the most liberating, soul-shaking, freedom-encapsulating, serotonin-fuelled self discovery 3 week mission of my 21 years lived thus far. The many people I met and the many places I went. Not only would this piece of design be a memoir to myself, but if composed beautifully enough, be a piece of consumable media for the individual who is naturally artistically inclined and presents an interest in indulging in my artwork composed in a digestible publication. It’s also a project; once manufactured; could go on to become commercially stocked in bookstores. It’s my dream to produce a hardcover book to the high standard of those stocked at Readings or Metropolis.",
        "bio":"Japan, from my many experiences, provides a main takeaway of sensory overload in the form of sound and vision and colour. It is a even of art and design and music appreciation. This is a main point of reflection I want embodied in my potential publication.\n\nI originally intended on this ethereal experience to be documented in illustrative form. I have the reference document of over 1000 photos I shot on a small digital handheld camera, however I am not a photographer and these are not necessarily skilfully captured photos. However, the subject matter what the people/places/things are the vital takeaway from these photos. In order to create a capstone project that challenges me to create my best body of design skill and work yet, I agreed with myself that these photos would best if used as a reference point for illustration, which I would consider my strong point in design. Upon drawing this developmental conclusion, a new question arises; what medium? What style? Cartoon, realistic? Oil, pencil, digital? After some extended mental debate, an initial lead on oil arose; which drew to an end after how long it took to make just one. Finally, a realistic update was drawn; that my pictures would be drawn realistically in pencil, scanned, and coloured on Photoshop. Not only will this method of action cut the time in half, it will allow me to make more. Quantity is a key point when creating a coffee-table style book (it’s gotta have a little chunk in that spine!). Colouring on photoshop will also allow me to really exponentially play with colours and patterns (an important point in accurately depicting Japan in my opinion).",
        "social": "https://instagram.com/alanalacyart"
      },
      {
        "id": 2,
        "name": "Angus Wicks",
        "tags": ["digital", "web"],
        "title": "Solace",
        "image": "Press/angus1.png",
        "image2": "Press/angus2.png",
        "image3": "Press/angus3.jpg",
        "image4": "Press/angus4.jpg",
        "year": "2023",
        "desc": "Solace is a skate street wear brand.\n\nThe aim being to capture the Melbourne street wear scene and incorporate aspects of skating and where i grew up in Fitzroy to produce clothing and accessories which mirror this.\n\nSolace skate street wear is not just about the clothes, it is a subculture that embodies a certain attitude and lifestyle.",
        "contact": "awicks10@hotmail.com"
      },
      {
        "id": 3,
        "name": "April Larsen",
        "tags": ["print"],
        "title": "Wetter & Wilder - A Colouring Book",
        "image": "Press/april1.png",
        "image2": "Press/april2.png",
        "image3": "Press/april3.png",
        "image4": "Press/april4.png",
        "year": "2023",
        "desc": "A colouring book made fore adults with a cheeky ocean theme.",
        "contact": "aprillarsen6@gmail.com"
      },
      {
        "id": 4,
        "name": "Beverly Angelina",
        "tags": ["illustration"],
        "title": "GARDIN",
        "image": "Press/beverly1.png",
        "image2": "Press/beverly2.png",
        "image3": "Press/beverly3.png",
        "image4": "Press/beverly4.png",
        "year": "2023",
        "desc": "Gardin produces character merchandise, from stationeries to tech accesories. Gardin is not just a brand, but is also a family of flowers. In this project, you can see them 'grow' through different seasosns, as well as enhance your stationeries from basic to colourful!\n\nGardin utilizes the use of bright colours and iconic illustrations that can cater to different age groups and target audiences. Really, there is no limit to who can enjoy this cuteness.\n\nThe name ‘Gardin’ is a word play from the word ‘Garden’, and the brand focuses around the four main mascots illustrated. ",
        "bio":"I'm Beverly, and I love to create all things colourful. As a designer, my comfort zone would be over-using sans-serif fonts, and pastel colours. I didn't expect I would love design as much as I do now when I started my first year at RMIT, but now I can say it's all I ever wanted to do. I enjoy doing branding, publication and as showcased in the grad show, I found out I also love doing illustrations. My creative practice mostly involves just me trying my best to push myself out of my comfort zone, but we all know how hard this is. I hate feeling like I wasn't doing well enough, or feeling disatisfied with my own designs. However, I overcame this by continously expanding my knowledge on design practices I'm not familiar of. Turns out, learning new skills and stepping out of my comfort zone is what made me grew as a designer. \n\nHaving the opportunity to do this capstone was something I always looked for as a designer. Creating something for the first time ever, and showcasing it on the grad show is definately nerve-wrecking, but I am proud of my work and how far I have come as a designer. After three years at RMIT, I can say that I am graduating with so many amazing experiences I never thought I'd get. Not only as a student, but I have found my passion as a person. RMIT really gave me the opportunity to take my time and figure out what kind of designer I am, the things I enjoy and the things I would rather keep in my folders. After this, I intend  to keep the student mentality inside of me as I hope to keep growing. ",
        "contact": "beverlytan.1708@gmail.com",
        "social": "https://instagram.com/beverlytann"
        
      },
      {
        "id": 5,
        "name": "Carol Xu",
        "tags": ["digital"],
        "title": "Design My Own Wedding",
        "image": "Press/yuchen1.jpg",
        "image2": "Press/yuchen2.jpg",
        "image3": "Press/yuchen3.jpg",
        "year": "2023",
        "desc": "The purpose of designing my wedding is to create a visually cohesive and memorable event that reflects our unique personalities and love story. We designed a visual language that includes the entire wedding process, such as colour palette, typeface, logo, invitations for family and friends, wedding posters, souvenir packaging, wedding menus, dress selection, background videos.\n\nBy using design to create a cohesive visual language, the wedding can feel like a cohesive and thoughtful event, rather than a collection of disparate elements.",
        "contact": "xuyuchen0911@gmail.com"      
      },
      {
        "id": 6,
        "name": "Cindy Zhang",
        "tags": ["digital"],
        "title": "Wedding Ceremony",
        "image": "Press/placeholder.png",
        "year": "2023",
        "contact": "S3793978@student.rmit.edu.au",
        "unfinished":""   
      },
      {
        "id": 7,
        "name": "Charles Ly",
        "tags": ["digital"],
        "title": "Affinite Rings",
        "image": "Press/charles1.jpg",
        "image2": "Press/charles2.jpg",
        "image3": "Press/charles3.jpg",
        "year": "2023",
        "desc": "Queer people have become cultural innovators at their own demise. Identifying other queer people has never been more difficult now that even the straight boys are cuffing their jeans!\n\n'Affinite Rings' was a UX design project the centred around creating a new way for queer people to meet each other by capitalising on the history of queer signalling and reimagining it in a new and discreet way!\n\nInstead of subtle fashion choices like cuffed pants or following the hankerchief code, Affinite Rings are marketed as a way to just make friends, allowing you fistbump someone to add them on social media. ",
        "bio":"Charles is a queer, Asian-Australian graphic designer, based in Naarm/Melbourne, that specialises in branding, UX and publication design.\n\nArt and design have always been a large part of his life. He believes that all things are beautiful, and that its his job as a designer to be able to highlight that beauty.",
        "contact": "charlesly2001@gmail.com",
        "portfolio": "https://charlesly.myportfolio.com/work"
      },
      {
        "id": 8,
        "name": "Deniz Olken",
        "tags": ["object"],
        "title": "Project 001",
        "image": "Press/deniz1.jpg",
        "image2": "Press/deniz2.jpg",
        "image3": "Press/deniz3.jpg",
        "year": "2023",
        "desc": "The project is a collection of mechanical body installations which materialise the concept of the mind as an independent, non-material entity existing alongside and separate to the ‘shell’ of the human form.\n\nThe essence of my line of work is to have people dwell on the morality of our livelihoods; considering the possibility of a technologically advanced world where the human consciousness can continue to coexist with robotics, beyond the capability of the human form. Additionally, I hadn’t had the opportunity to work on a big project outside of my university schedule, so being able to incorporate it into my studies for 6 weeks so I can continue to pursue it after my studies is quite exciting. I’ve also been intrigued by mecha-wear for the longest time, so having the chance to create a series of wearable artefacts myself is a great way of finally being able to give my all rather than shying away from this project that I’ve been longing to pursue.",
        "bio":"My name is Dee. I'm a 22 year old digital illustrator located in Narrm, Australia. I attend RMIT University's design school and am currently completing my third year in the Bachelor of Communication Design. I aim to put out more creative content & meet like-minded creatives to expand my artistic knowledge and abilities. As an illustrator and digital designer, I intend to delve into UX/UI design and working with mix mediums to broaden the flexibility of my skillsets in my own distinctive style.",
        "contact": "0001d.archive@gmail.com",
        "social": "https://0001d.carrd.co/",
        "portfolio": "https://0001dd.wixsite.com/0001dportfolio"
      },
      {
        "id": 9,
        "name": "Ella Taylor",
        "tags": ["print"],
        "title": "Lacking Representation ",
        "image": "Press/ella1.png",
        "image2": "Press/ella2.png",
        "image3": "Press/ella3.png",
        "image4": "Press/ella4.png",
        "year": "2023",
        "desc": "Lacking Representation is all inclusive surf and art exhibition, that takes the form of publication.\n\nIt’s a way of life that is celebrated through community, art and environment.\n\nA place to bring those together who feel they lack representation, a way to unveil the effects the ocean has on the creative mind’s of those who borrow her.",
        "bio":"Ella is a practicing creative, specialising in branding and publication design, with a combination of landscape and portrait photography. Ella’s authetic approach to design, exploring tactile mixed media allows her  to create expressive experiences through all bodies of work.",
        "contact": "ella@eettstudios.com",
        "portfolio":"https://eettstudios.cargo.site",
        "social": "https://instagram.com/eettstudios"
      },
      {
        "id": 10,
        "name": "Emili Keisha",
        "tags": ["logo", "identity"],
        "title": "UBI",
        "image": "Press/emili1.png",
        "image2": "Press/emili2.png",
        "image3": "Press/emili3.png",
        "image4": "Press/emili4.png",
        "image5": "Press/emili5.png",
        "year": "2023",
        "desc": "UBI (short for Ubiquitous) is a rebrand of the iconic movie Everything Everywhere All At Once as a bagel restaurant.\n\nThe movie “Everything Everywhere All at Once” tells a story about a Chinese mother: Evelyn Wang discovers that she alone can save the world by exploring multiverse dimensions and connecting with the lives she could’ve had. Keywords of this movie will be Multiverse, Fantasy, and Family.\n\nBagel, googly eyes, and more movie references are incorporated into my branding (so watch out for all of them!). To visualize the main part of this movie: 'Multiverse' I apply different design approaches to my brand whilst still making sure it all aligns.",
        "bio":"I'm Emili, a designer based in Melbourne. My friendship with design has gone way back. I have always loved creating and wish to bring happiness through my designs. I have a particular interest in illustrations, publication design, and branding.",
        "contact": "emilikeisha@gmail.com",
        "social": "https://instagram.com/pensilemili"
      },
      {
        "id": 11,
        "name": "Finn Stewart",
        "tags": ["sitebased", "object"],
        "title": "To Build A Home",
        "image": "Press/finn2.jpeg",
        "image2":"Press/finn.jpg",
        "year": "2023",
        "desc": "( One )\n\nTo make out of one world, another world\nTo build a home, inside and out-of the world\nTo play\nTo glean\nTo improvise\nTo see potential\nTo manifest\nTo go out of your way\nTo be irrational\nTo humanize\nTo make impressions\nTo make one out of many\nTo be embraced by your personal space\nTo display your contradictions under one roof\nTo collect souvenirs of experience, and fashion them into something \n\nFrom useless, to useful\nFrom decaying, to preserved\nFrom ruins to palace\n\nThe spiritual and sensuous sonatas of objects\nThe juxtaposition of functionality and irrationality\nThe juxtaposition of comfort and crud\nThe opposition of austerity and luxury\nThe gesture of upcycling\n\nThe chorus of objects\n\n\nThrough this series To Build A Home, artist and designer Finn Stewart manifests the potential of post-consumer material– fashioning functionalist forms imbued with idiosyncratic readings. Through his gestures of upcycling, he finds a vernacular of contradiction which oscillates between rational non-functionalism and irrational functionalism.\n\nFinn humorously references canonical designs of the minimalist art period. As in the case of “Donald Crudd”, he borrows Judd’s simplistic model, juxtaposing it with reclaimed material and ultimately puts the modernist form on trial.\n\nThrough his intuitive process of selection and assemblage, Finn leaves human impressions on that which is typically mass produced. The comfort and value found in these flawed objects brings home the precarious and catalytic nature of this artist’s lifestyle. They are his artifacts of lived experience, caught between crosswinds of desire and austerity.",
        "bio":"Finn Stewart is a multidisciplinary designer and visual artist, currently working and residing in Melbourne (Naarm)– upon the unceded lands of the Eastern Kulin Nation. Finn works across graphics, animation, products, and environments, with the intent to create joyful and cohesive experiences for; arts & culture, public space, brands, events, and institutions.\n\nWith a tenacious passion for creativity, Finn dedicates himself to personal and collaborative projects that extend his conceptual and technical abilities. These projects include; architecture, fashion, garden design, interior design, VFX, photography, and sculpture.\n\nFinn’s expertise in; Illustrator, Photoshop, InDesign, Figma, and Blender, gives him the capacity to ideate identities with dialogues between 2D and 3D. Grounded by his diversified skillset and playful approach to uncovering possibilities, Finn is particularly suited to working in smaller design studios that value an eye for detail and lateral thinking.",
        "contact": "finnstewart@me.com"
      },
      {
        "id": 12,
        "name": "Jazelle Mackenzie",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 13,
        "name": "Jasmine Wang",
        "tags": ["poster", "layout"],
        "title": "Me & You Together (Song)",
        "image": "Press/jasmine1.jpg",
        "year": "2023",
        "desc": "A publication soundtracked to life and the sounds found around us.",
        "contact": "jasw6101@gmail.com",
        "social": "https://instagram.com/jasmoone_",
        "unfinished":""
      },
      {
        "id": 14,
        "name": "Juliette Rosa",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 15,
        "name": "Katya Vergara",
        "tags": ["print", "illustration"],
        "title": "Grimm's Fairy Tales",
        "image": "Press/katya1.jpg",
        "image2": "Press/katya2.jpg",
        "image3": "Press/katya3.jpg",
        "image4": "Press/katya4.jpg",
        "year": "2023",
        "desc": "A picture story book of selected fairy tales from the Brothers Grimm collection containing new and original illustrations. Inspired by my personal love for drawing and the many hours spent looking at old books at thrift stores.",
        "bio":"Katya is an illustrator and designer that loves the look of old things, especially in art, film and design. She loves to collect art books and listen to movie scores.",
        "contact": "katya.lee.vergara@gmail.com"
      },
      {
        "id": 16,
        "name": "Leon Li",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 17,
        "name": "Li Yeng Hiu",
        "tags": ["identity", "sitebased", "digital"],
        "title": "Beam",
        "image": "Press/liyeng1.jpg",
        "image2": "Press/liyeng2.png",
        "image3": "Press/liyeng3.png",
        "image4": "Press/liyeng4.png",
        "image5": "Press/liyeng5.jpg",
        "year": "2023",
        "desc": "Teleportation - the ability to instantly an object from one location to another. Beam creates this popular concept in science fiction into reality. They’ve spearheaded launching teleportation technology into a wearable bracelet device, allowing anyone travel without boundaries. This revolutionary mode of transport will change the future of transport forever, even in a snap.\n\nThis campaign’s objective is to craft Beam’s brand image, promoting their new convenient way of transport as the new go-to. Using the software, Blender, I crafted a 3D render of Beam’s bracelet design. Additionally, in order to keep a cohesive brand identity for Beam, the bracelet design is complemented with an intuitive app that seamlessly interacts with the bracelet, providing users with effortless control. A product of this measure requires amplification to spread the word. So, I’ve created Beam promotional materials to engage with the public, inclusive of posters and a banner ad, ready to capture the attention of potential consumers.",
        "bio":"Li Yeng holds the belief that art manifests in myriad forms, whether it be the graffiti on a wall or the patterns embossed on a paper towel. Art is ever-present, constantly inspiring her through the ordinary elements of life. As a communication designer, she resists confining herself to a box, instead embracing a hands-on approach that fuels her continuous learning. By exploring artistic elements, she aims to breathe life into her designs and foster a multidimensional visual experience.",
        "contact": "liyenghiu@gmail.com",
        "portfolio": "https://behance.net/liyeng",
        "social": "https://linkedin.com/in/liyenghiu/"
      },
      {
        "id": 18,
        "name": "Natalie Chen",
        "tags": ["illustration", "print", "object"],
        "title": "Eastern Women: Bound & Free",
        "image": "Press/yixuan1.jpg",
        "image2": "Press/yixuan2.jpg",
        "image3": "Press/yixuan3.jpg",
        "image4": "Press/yixuan4.jpg",
        "year": "2023",
        "desc": "The handmade book, 'Eastern Women: Bound and Free,' is an expressive and thought-provoking exploration of the challenges, oppression, and resilience experienced by women in the East.\n\nThrough a creative blend of illustrations, collages, photographs, and compelling written content, this book delves into the depths of the Eastern woman's journey. It seeks to shed light on the various ways in which women in the East are bound by societal expectations, cultural norms, and gender roles, while also celebrating their capacity to break free and redefine their identities.\n\nEach page of the book serves as a window into the multifaceted experiences of Eastern women, capturing their struggles, dreams, and triumphs. The content examines the oppression and limitations imposed on women's thoughts and behaviors, such as conforming to traditional gender roles, facing dress codes and beauty standards, staying silent versus using their voices, and grappling with the complexities of relationships and family expectations.\n\nThis project aims to inspire and empower women by highlighting their resilience, strength, and ability to overcome adversity. It encourages women to embrace their unique identities, challenge societal norms, and pave the way for a more inclusive and equitable future. By presenting contrasting representations of 'bound' and 'free,' the book creates a visual and emotional journey that ignites a sense of liberation and motivates readers to question, reflect, and take action.\n\nThe book invites viewers to immerse themselves in the rich tapestry of Eastern women's experiences, fostering empathy, understanding, and solidarity. Through this artistic medium, it is hoped that the project will contribute to a wider movement of empowerment and social change, encouraging individuals to question the status quo and actively participate in the ongoing journey towards equality and freedom.",
        "bio": "Hi, I'm Yixuan Chen (Natalie).\n\nAs a student majoring in Communication Design, I have been on a constant journey of exploration, seeking to convey meaningful stories through visual means. Over the past three years, I have found inspiration and solace in the realm of creativity. I am passionate about observing negative social news as it serves as a catalyst for my creative inspiration.\n\nArt knows no boundaries. Creating works that challenge traditional norms, disrupt the status quo, and encourage dialogue has repeatedly affirmed my sense of worth, even though my voice may be small and faint. I have grown accustomed to letting my works speak for me, striving to resonate with audiences on multiple levels, in pursuit of a more inclusive and equitable world.\n\nSince embarking on my design journey, I have been driven by an insatiable curiosity, constantly seeking to expand my horizons and push the boundaries of my own practice. This relentless pursuit of learning and growth propels me forward, ensuring that I am always evolving as a designer and as an individual.",
        "social": "https://instagram.com/ciixn1126"
      },
      {
        "id": 19,
        "name": "Nicholas Gleeson",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 20,
        "name": "Paul Weedon",
        "tags": ["illustration"],
        "title": "Welcome to the Dream State",
        "image": "Press/paul1.jpg",
        "year": "2023",
        "desc": "What is it?\nA book of a story about dreams told through imagery.\nThe story is  told through a series of wordless two page spreads. As in a dream state each spread presents a whole scene or environment as an immersive space that occupies the whole of our attention.\n\nThis work is an exploration or experiment. It is a way for me to think out loud about the possibilities of long form illustration for publication and about creating substantial projects independently.\n\nMaking this book has been an informative, challenging and inspiring way to research one of the directions in which I would like to take my design practice.",
        "bio":"From I’ve been working ‘graphics’ jobs in Melbourne for a lot of my working life. Covid-19 restrictions stopped that, but also gave me the time and chance to study design.\nBest lock-down outcome evvvah!\n\nI’ve used this Capstone personal project as chance to make something no one else would be likely to commission. It has been a good opportunity to try something largish in a single sustained style.  The artifact offers a lot of ‘scope for development’, but as an investigation into an area of personal interest the project feels like a success. Having an environment to road-test a self-devised project was valuable and helpful.\n\nAt the end of this course there are a LOT of possibilities and pathways ahead of a designer. In classes and studios we all create a great variety of work for varied purposes. I’d not thought of myself as an ‘illustrator’, but when I have been required to illustrate - I’ve found it an enjoyable challenge. It has been a great opportunity to use this project as a way to explore another idea of what a design career might be like.",
        "contact": "paulweedon3000@gmail.com"
      },
      {
        "id": 21,
        "name": "Quan Ming Li",
        "tags": ["digital"],
        "title": "Chewy Chewy Dessert",
        "image": "Press/quan1.jpg",
        "image2": "Press/quan2.png",
        "image3": "Press/quan3.png",
        "image4": "Press/quan4.png",
        "year": "2023",
        "desc": "Chewy Chewy Dessert is a young, adorable dessert brand dedicated to providing desserts with a Chinese twist. The core concept of the brand is to combine traditional Chinese desserts with modern elements to create a fresh and creative dessert experience.\n\nMy design work focused on the creation of the brand identity and visual elements. First, I redesigned the Chewy Chewy Dessert logo to simplify and optimize the original design to be more in line with the brand's youthful and cute style. The logo uses soft colors combined with clean lines and light fonts to show the brand's liveliness and approachability.\n\nIn addition to the logo, I also designed the brand's graphic elements, including a cute dessert illustration and a decorative floral pattern. These graphic elements are used to create the brand's visual identity and provide a unique visual effect for the brand's promotional materials and product packaging. The style of the illustrations is lively and fun, which fits with the brand's youthful positioning.\n\nIn addition, I will update the brand's website and social media accounts in the future to showcase the latest dessert products and interact with consumers. The design of the website focused on user experience and communication of the brand image, allowing users to easily understand the brand's story and product information. The design of the social media accounts included creative images and engaging content to attract more followers and potential customers.\n\nMy design work also included updating the price list and packaging design to accommodate new product launches. The price list was designed to be simple and clear, making it easy for customers to understand the prices and flavor choices of various desserts. The packaging design focuses on brand image presentation to attract consumers' attention and convey the high quality and deliciousness of the products.\n\nThrough these design efforts, I aimed to create a compelling and enjoyable brand image that would make Chewy Chewy Dessert stand out in the Melbourne dessert market and attract more dessert lovers to taste and experience it.",
        "bio":"I am a graphic designer who strives to learn to become better, with a passion for creative design and visual communication. I enjoy translating ideas and concepts into concrete design work, creating compelling visuals through elements such as color, typography and graphics. I have experience using a wide range of design skills and tools that can be flexibly applied in areas such as branding, logo design, print advertising and digital media. With an eye for detail and user experience, I am committed to providing innovative and engaging design solutions for my clients.",
        "contact": "3144872540@qq.com"
      },
      {
        "id": 22,
        "name": "Raquel Laing-Nobrega",
        "tags": ["print", "layout"],
        "title": "Slice",
        "image": "Press/raquel.png",
        "year": "2023",
        "desc": "‘Slice’ is an illustrative zine showcasing quotes from a diary I kept in high school, displaying them alongside graphics in a comic-style format. This zine publication translates the incoherent ramblings of a troubled teen into visual information in a comedic and entertaining way.\n\nActing as a strong expression of self, I intend to express my own individualism by vocalizing my experiences. The zine is bound by a saddle-stitched, A5 in size and 24 pages long. Each quote is accompanied by a satirical illustration, printed with a Risograph printer to produce vibrant colours.",
        "contact": "s3899883@student.rmit.edu.au",
        "unfinished":""
      },
      {
        "id": 23,
        "name": "Rio Muniandy",
        "tags": ["illustration", "identity"],
        "title": "This Could Be It ",
        "image": "Press/rionna1.jpg",
        "image2": "Press/rionna2.png",
        "image3": "Press/rionna3.png",
        "image4": "Press/rionna4.png",
        "image5": "Press/rionna5.png",
        "year": "2023",
        "desc": "This Could Be It (TCBI) it is a 64 page proposal for a new immersive arts and culture festival, from research phases through to the design outcomes. The proposal is aimed towards the City of Melbourne and RISING as part of the city’s attempts to reignite its cultural scene following the impacts of the pandemic. \n\nTCBI is a festival of light, sound, performing arts, dance, and artistic collaboration that will happen at Birrarung Marr for three days during the first week of Winter. TCBI will be a venue with various attraction ‘tents’, F&B carts, and roaming performance acts that reflect the central theme of wonder. TCBI is a love letter to being and dreaming big. Many of TCBI’s attractions are based on personal memories that have really impacted my character and inspired moments of wonder.",
        "bio":"I believe that I’m a creative who strives to find common ground with my audience and communicate the nitty grittiness of being alive in dynamic ways. I also believe that my work will always be inspired by moments of wonder and awe, as they have stuck with me the most. I also enjoy hiding symbolism and narrative in visual elements which is a real testament to my fine arts background. This I know will be useful going forward, as good designs are the ones anchored in narrative and meaning.",
        "contact": "riomuniandy@gmail.com"
      },
      {
        "id": 24,
        "name": "Rongsheng Liang",
        "tags": ["print", "layout"],
        "title": "Chinese Motifs",
        "image": "Press/rongshen1.png",
        "image2": "Press/rongshen2.png",
        "image3": "Press/rongshen3.png",
        "year": "2023",
        "desc": "Resurgence of the Ancient: A Modern Approach to Chinese Motifs, is a profound exploration and integration of traditional Chinese motifs into modern digital design. This endeavour is a reflection of my personal journey of understanding and appreciating my Chinese heritage, applying the wisdom of the past to the creative pursuits of the present. My body of work contains a series of three posters, each drawing inspiration from Confucianism, Buddhism, and Taoism – the “Three Teachings” that have shaped Chinese culture and art for millennia.\n\nIn the process, I've aimed to highlight the enduring relevance of these ancient philosophies and their motifs in today's world, creating a harmonious blend of tradition and modernity. I've incorporated the symbolism associated with these philosophies – the solemnity and societal harmony of Confucianism, the spiritual awakening of Buddhism, and the natural balance of Taoism – into my designs, which take cues from the design languages of modern artists Yue Minjun, Yayoi Kusama, and Kenya Hara.\n\nThis project is as much about self-discovery as it is about design. Through it, I've learned not only the mechanics of merging traditional motifs with modern design techniques but also the depth and richness of my own cultural heritage. As I navigated the challenges of synthesising these different elements, I found myself deepening my understanding of both my craft and my identity.\n\nThe work I present is a testament to the power of design as a medium of self-expression, cultural preservation, and innovation. It's my belief that these designs will speak to viewers – not just of the beauty and elegance of Chinese motifs and modern design – but also of the profound philosophy and heritage they embody.",
        "bio":"As a passionate and intuitive designer, I find myself constantly drawn to the intersection of tradition and innovation, where the wisdom of the past meets the creativity of the present. Rooted in my Chinese heritage, my work often reflects the rich tapestry of Chinese culture, art, and philosophy, yet, it's equally inspired by contemporary design aesthetics. The harmony of these diverse influences characterises my creative approach, which I view as an ongoing journey of self-discovery, cultural exploration, and aesthetic evolution."
      },
      {
        "id": 25,
        "name": "Sophie Jones",
        "tags": ["poster", "layout"],
        "title": "Kind Regards",
        "image": "Press/sophie1.jpg",
        "image2": "Press/sophie2.jpg",
        "year": "2023",
        "desc": "The brand identity and web shopfront of Kind Regards, an online print store; Accompanied by four prints carried by the store.",
        "bio":"Sophie is a Melbourne based Visual Communication Designer.\n\nWith a special interest in Identity Design, her application skills transcend Digital, Print, Merchandise and Packaging design. ",
        "contact": "hello@sophiejones.design",
        "portfolio": "http://sophiejones.design"
      },
      {
        "id": 26,
        "name": "Sum Tsui",
        "tags": ["identity", "multimedia", "sitebased"],
        "title": "'Being Human' Exhibition Proposal and Design ",
        "image": "Press/sum1.png",
        "image2": "Press/sum2.png",
        "image3": "Press/sum3.png",
        "image4": "Press/sum4.png",
        "image5": "Press/sum5.png",
        "year": "2023",
        "desc": "The aim of this project is to develop an exhibition or event proposal for our chosen cultural organisation. I developed an exhibition proposal for the Australian art gallery NGV (National Gallery of Victoria).\n\n“Being Human” is an art and design exhibition that explores the multifaceted meaning of what it means to be human. By presenting an array of art and design works, it invites the audience to pause and reflect on their past and present choices, experiences, needs, and wants, and think about how they would like to proceed and possibly live differently in the future as an individual, as well as collectively. For those who feel lost and are unsure about what they want in life, the artworks and designs in this exhibition provide some starting points for them to consider. Ultimately, the exhibition aims to empower the audience to be brave and live the life they want.\n\nThe exhibition proposal features a toolbox of visual elements such as color scheme, typography, logo, and hero images that can be combined and applied to a broad range of promotional materials. It also includes a basic plan and visualisation of the visitor’s experience in the exhibition.",
        "bio":"One of my studio leads once said to me, “continue to push beyond what the brief asks from you”. This is something that I am always trying to do, and will continue to do so.\n\nI believe design is about creating experiences. My work is a constant search for how to create a unique, impactful, and memorable experience for the audience. My passion as a designer lies in exploring the intersection of publication design, packaging design, 3D design, and architectural design. ",
        "contact": "sumtsui48@gmail.com"
      },
      {
        "id": 27,
        "name": "Teresa Si Pei Wee",
        "tags": ["digital"],
        "title": "Hike Guide - UI/UX Design",
        "image": "Press/teresa1.jpg",
        "image2": "Press/teresa2.jpg",
        "image3": "Press/teresa3.jpg",
        "image4": "Press/teresa4.jpg",
        "year": "2023",
        "desc": "Experiencing the great outdoors on your own can provide a unique sense of freedom and adventure that is difficult to replicate elsewhere. However, it can also be daunting and lonely at times. That's where Hike Guide comes in – an app designed specifically for beginners and hiking enthusiasts to connect and foster a community.\n\nOne of the key challenges we've identified is the overwhelming amount of cluttered and potentially inaccurate information available online. Our aim is to offer a safer hiking experience for users by providing reliable and verified information. With Hike Guide, hikers have access to a comprehensive platform where they can search and select hiking routes based on their preferences. Our app saves users valuable time with efficient filter features, ensuring a hassle-free experience.\n\nFurthermore, Hike Guide goes beyond simply offering route recommendations. We facilitate connections between hikers, allowing them to find like-minded individuals and even join organized tours. This enables users to build friendships with others who share the same interests and passion for hiking. Additionally, we provide a wealth of informative articles tailored for beginners, offering essential knowledge and preparation tips before embarking on a hike. For seasoned hikers, our app serves as a valuable resource to discover new and popular hiking trails.\n\nAll the content within Hike Guide is carefully curated by experienced hikers, ensuring the information is reliable and relevant. Moreover, we prioritize safety by integrating features such as danger alerts, offline maps, emergency SOS functionality, and even a torchlight direction projection. With these features, hikers can navigate their adventures with confidence and peace of mind.\n\nUltimately, our app encourages Australians to embrace a healthier lifestyle and promote outdoor activities. Hike Guide serves as a catalyst for individuals to immerse themselves in nature, fostering a sense of well-being and appreciation for the beauty of the great outdoors.",
        "bio":"Pei, a graphic designer from Malaysia, embarked on her freelancing journey in 2021. She has worked with clients across various industries, including beauty, health, food and beverage, and corporate business and more.  She specializes in both digital and print-ready collaterals, such as branding, packaging design, social media designs, UI/UX design and more.\n\nBeyond her professional endeavors, Pei nurtures a passion for photography and video shooting for YouTube/Reels/Ads content creation along with video editing skills.\n\nHaving pursued studies in marketing and business entrepreneurship at RMIT, coupled with her practical experience working in a marketing agency, Pei possesses a sound understanding of marketing principles. This knowledge enriches her design approach, enabling her to deliver effective visual communication solutions. Pei firmly believes that exceptional designs are a result of collective effort, valuing the input and ideas of every team member. She welcomes feedback and thrives in collaborative environments, actively engaging with clients to bring their visions to life.\n\nGot a new project in mind? Contact me to discuss and explore how we can work together to create beautiful, functional, and impactful designs.",
        "social": "https://instagram.com/peistudios"
      },
      {
        "id": 28,
        "name": "William Hunt",
        "tags": ["logo"],
        "title": "AI Designed Helmet Making",
        "image": "Press/placeholder.png",
        "year": "2023",
        "desc": "This project was about discovering how AI generated images could be used in my own design process, with a final output of a painted racing helmet.",
        "bio":"",
        "contact": "s3873473@student.rmit.edu.au",
        "unfinished":""
      },
      {
        "id": 29,
        "name": "Xiaohui Jia",
        "tags": ["object"],
        "title": "Bug Buddies",
        "image": "Press/xiaohui1.png",
        "image2": "Press/xiaohui2.png",
        "image3": "Press/xiaohui3.png",
        "year": "2023",
        "desc": "Bug Buddies is a blind box brand featuring a little boy dressed up as various insects.\n\nBug Buddies encourages environmental and ecological protection. It is an educational and entertaining blind box brand suitable for children of all ages and insect enthusiasts",
        "contact": "s3822722@student.rmit.edu.au"
      },
      {
        "id": 30,
        "name": "Xinyuan Du",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 31,
        "name": "Xin Yin",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 32,
        "name": "Yidi Wang",
        "tags": [""],
        "title": "Land of Eternity",
        "image": "Press/yidi1.jpg",
        "image2": "Press/yidi2.jpg",
        "image3": "Press/yidi3.jpg",
        "year": "2023",
        "desc": "Land of Eternity is a modern Pet Funeral company that prioritizes transparency and choice.\n\nThis brand aims to carry the emotional attachment that countless pet owners have for their beloved pets.\n\nThe significance of Land of Eternity is in creating a new island, a warm and safe place full of hope.\n\nLet the memory of your pet live on forever.\n\nThe brand provide a range of services that cater to the needs of pet owners during the difficult time of pet loss.\n\nCreate personalized and everlasting memorials for your pet.",
        "bio":"My artwork stems from two simple desires. First, separation has always been a heavy topic for humans. Not every pet owner can immediately accept the reality of their pet's passing. Therefore, I aim to help those who are grieving the loss of a beloved pet. Second, with the concept of the Land of Eternity, I offer an emotional buffer. Providing a proper farewell to their pets makes their journey in this life worthwhile.\n\nDuring my childhood, conflicts at home burdened me with constant anxiety, making me dread returning home. However, everything changed when I welcomed a small dog into my life. The unconditional love and daily anticipation of their warm welcome after school brought me solace. Yet, as time passed, like any ordinary adult, my dog was said to have transcended to heaven. Curiosity sparked within me about the nature of heaven and whether it could have a tangible existence. This curiosity became the foundation for my artistic expression.",
        "contact":"00yidi@gmail.com"
      },

      {
        "id": 33,
        "name": "Zixin Alexis Liu",
        "tags": ["illustration", "digital"],
        "title": "Serpent's Petals: Wine Designs Embracing Flora and Fauna",
        "image": "Press/zixin1.jpg",
        "image2": "Press/zixin2.jpg",
        "image3": "Press/zixin3.jpg",
        "image4": "Press/zixin4.jpg",
        "image5": "Press/zixin5.jpg",
        "year": "2023",
        "desc": "Serpent's Petals is a design project that seamlessly merges the worlds of wine and art while embracing the beauty of flora and fauna. The enigmatic allure of the blue viper snake and the delicate elegance of the lotus flower inspired it.\n\nAt the heart of Serpent's Petals is a collection of wine designs that transport enthusiasts on a sensory journey through the natural world. Each bottle, coaster, box, and carry bag showcases the intricate interplay between the serpentine grace of the blue viper and the delicate petals of the lotus, intricately intertwined with lush vines symbolising the essence of life.",
        "contact": "alexis.z.l@outlook.com"      
      },
      {
        "id": 34,
        "name": "Ziyu Shen",
        "tags": ["print", "object"],
        "title": "Scientism",
        "image": "Press/ziyu1.jpg",
        "image2": "Press/ziyu2.jpg",
        "image3": "Press/ziyu3.jpg",
        "year": "2023",
        "desc": "This project challenges the notion that science and religion are mutually exclusive by exploring their intricate relationship. While religion is often seen as emotional and superstitious, and science as calm and objective, there is a dialectical cognition of things in religion that conforms to the spirit of science. Conversely, those who believe that science is the only means of understanding the world are embracing the spirit of religion.\n\nThe project presents the scientific symbol system in religious visual form and presents religious concepts with scientific infographic forms, revealing the complex intertwinement of science and religion. By creating something scientific yet imbued with religious and metaphysical connotations, the project aims to encourage the audience to think about the combination of science and religion and to challenge their dualistic view of the two.",        
        "bio":"I‘m a designer who grew up in Shanghai, China, studied communication design at RMIT in Australia. In my design practice, I specialize in creating visually striking posters and symbols. I also have a strong passion for brand expressions and enjoy collaborating with designers from different fields.\n\nAs a visual designer, I explore various mediums and techniques, including painting and creating visual arts in different shapes and materials. I view design as a powerful tool for artistic expression, allowing me to convey my ideas and perspectives to the world. My work is driven by a desire to evoke emotions and create experiences that deeply resonate with people. I like to explore large issues such as consumerism, technology, tradition, and politics through visual symbols. I am an advocate of multidisciplinary approaches and thrive on the collaborative process. I draw inspiration from diverse fields and perspectives, constantly seeking new ideas and innovative solutions. ",
        "contact": "eeeelki0129@gmail.com",
        "social": "https://instagram.com/dgarcia.design"
      },

      {
        "id": 35,
        "name": "Zoe White",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 36,
        "name": "Zoe Zhou",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "unfinished":""
      },
      {
        "id": 37,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/1.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 38,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/2.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 39,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/3.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 40,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/4.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 41,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/5.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 42,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/6.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 43,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/7.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 44,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/8.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 45,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/9.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 46,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/10.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 47,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/11.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 48,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/12.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 49,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/13.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 50,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/14.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 51,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/15.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 52,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/16.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 57,
        "name": "sys",
        "tags": [""],
        "title": "Instructional",
        "image": "Random/instructions.png",
        "year": "",
        "desc": ""
      }
    ]
  }