{
    "students": [
      {
        "id": 0,
        "name": "Alana Eve Lacy",
        "tags": ["identity", "logo"],
        "title": "Western Girl In Japan",
        "image": "Press/alana.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "I want to create this piece of design to immortalise in hard copy the most liberating, soul-shaking, freedom-encapsulating, serotonin-fuelled self discovery 3 week mission of my 21 years lived thus far. The many people I met and the many places I went. Not only would this piece of design be a memoir to myself, but if composed beautifully enough, be a piece of consumable media for the individual who is naturally artistically inclined and presents an interest in indulging in my artwork composed in a digestible publication. It’s also a project; once manufactured; could go on to become commercially stocked in bookstores. It’s my dream to produce a hardcover book to the high standard of those stocked at Readings or Metropolis.",
        "bio":"",
        "contact": "s3844634@student.rmit.edu.au"
      },
      {
        "id": 1,
        "name": "Angus Wicks",
        "tags": ["digital", "web"],
        "title": "Solace",
        "image": "Press/angus.jpg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "Solace is a skate street wear brand.\n\nThe aim being to capture the Melbourne street wear scene and incorporate aspects of skating and where i grew up in Fitzroy to produce clothing and accessories which mirror this.\n\nSolace skate street wear is not just about the clothes, it is a subculture that embodies a certain attitude and lifestyle.",
        "bio":"",
        "contact": "awicks10@hotmail.com"
      },
      {
        "id": 2,
        "name": "April Larsen",
        "tags": ["print"],
        "title": "Wetter & Wilder - A Colouring Book",
        "image": "Press/april.JPG",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "A colouring book made fore adults with a cheeky ocean theme.",
        "bio":"",
        "contact": "aprillarsen6@gmail.com"
      },
      {
        "id": 3,
        "name": "Beverly Angelina",
        "tags": ["logo", "identity"],
        "title": "Gardin",
        "image": "Press/beverly.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "Gardin produces character merchandise, from stationeries to tech accesories. Purchasing products from Gardin can enhance your stationery collection from dull and basic, to eye catching ones.\n\nGardin utilizes the use of bright colours and iconic illustrations that can cater to different age groups from students to corportate workers.",
        "bio":"",
        "contact": "s3741688@student.rmit.edu.au"
      },
      {
        "id": 4,
        "name": "Carol Xu",
        "tags": ["digital"],
        "title": "Wedding Ceremony",
        "image": "Press/yuchen.jpeg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": "xuyuchen0911@gmail.com"      
      },
      {
        "id": 5,
        "name": "Cindy Zhang",
        "tags": ["digital"],
        "title": "Wedding Ceremony",
        "image": "Press/xinyi.jpeg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": "S3793978@student.rmit.edu.au"      
      },
      {
        "id": 6,
        "name": "Charles Ly",
        "tags": ["digital", "identity"],
        "title": "Affinite Rings",
        "image": "Press/charles.jpg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "Queer people have become cultural innovators at their own demise. Identifying other queer people has never been more difficult now that even the heterosexuals are cuffing their jeans!\n\n'Affinite Rings' was a UX design project the centred around creating a new way for queer people to meet each other by capitalising on the history of queer signalling and reimagining it in a new and discreet way!\n\nInstead of subtle fashion choices like pierced ears or the hankerchief code, Affinite Rings are marketed as a way to make friends, allowing you fistbump someone to add them on social media. Way to appropriate straight culture!",
        "bio":"",
        "contact": "s3849187@student.rmit.edu.au"
      },
      {
        "id": 7,
        "name": "Claire Jia",
        "tags": ["identity"],
        "title": "Bug Buddies",
        "image": "Press/claire.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "Bug Buddies is a blind box brand featuring a little boy dressed up as various insects. Each blind box includes a random little boy toy with a different insect theme and design.",
        "bio":"",
        "contact": "s3822722@student.rmit.edu.au"
      },
      {
        "id": 8,
        "name": "Dee Caliskan",
        "tags": [""],
        "title": "Experiment 001",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "The project is a collection of mechanical body installations which materialise the concept of the mind as an independent, non-material entity existing alongside and separate to the ‘shell’ of the human form.",
        "bio":"",
        "contact": "s3841977@student.rmit.edu.au"
      },
      {
        "id": 9,
        "name": "Elki Shen",
        "tags": ["print", "layout"],
        "title": "Scientism",
        "image": "Press/ziyu.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "This project challenges the notion that science and religion are mutually exclusive by exploring their intricate relationship. While religion is often seen as emotional and superstitious, and science as calm and objective, there is a dialectical cognition of things in religion that conforms to the spirit of science. Conversely, those who believe that science is the only means of understanding the world are embracing the spirit of religion.\n\nThe project presents the scientific symbol system in religious visual form and presents religious concepts with scientific infographic forms, revealing the complex intertwinement of science and religion. By creating something scientific yet imbued with religious and metaphysical connotations, the project aims to encourage the audience to think about the combination of science and religion and to challenge their dualistic view of the two.",        
        "bio":"",
        "contact": "s3884979@student.rmit.edu.au"
      },
      {
        "id": 10,
        "name": "Ella Taylor",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 11,
        "name": "Emili Keisha",
        "tags": ["logo", "identity"],
        "title": "UBI",
        "image": "Press/emili.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "UBI (short for Ubiquitous) is a rebrand of the iconic movie Everything Everywhere All At Once as a bagel restaurant.\n\nThe movie “Everything Everywhere All at Once” tells a story about a Chinese mother: Evelyn Wang discovers that she alone can save the world by exploring multiverse dimensions and connecting with the lives she could’ve had. Keywords of this movie will be Multiverse, Fantasy, and Family.\n\nBagel, googly eyes, and more movie references are incorporated into my branding (so watch out for all of them!). To visualize the main part of this movie: 'Multiverse' I apply different design approaches to my brand whilst still making sure it all aligns.",
        "bio":"",
        "contact": "s3825563@student.rmit.edu.au"
      },
      {
        "id": 12,
        "name": "Finn Stewart",
        "tags": [""],
        "title": "To Build A Home",
        "image": "Press/finn2.jpeg",
        "image2":"Press/finn.jpg",
        "year": "2023",
        "desc": "( One )\n\nTo make out of one world, another world\nTo build a home, inside and out-of the world\nTo play\nTo glean\nTo improvise\nTo see potential\nTo manifest\nTo go out of your way\nTo be irrational\nTo humanize\nTo make impressions\nTo make one out of many\nTo be embraced by your personal space\nTo display your contradictions under one roof\nTo collect souvenirs of experience, and fashion them into something \n\nFrom useless, to useful\nFrom decaying, to preserved\nFrom ruins to palace\n\nThe spiritual and sensuous sonatas of objects\nThe juxtaposition of functionality and irrationality\nThe juxtaposition of comfort and crud\nThe opposition of austerity and luxury\nThe gesture of upcycling\n\nThe chorus of objects\n\n\nThrough this series To Build A Home, artist and designer Finn Stewart manifests the potential of post-consumer material– fashioning functionalist forms imbued with idiosyncratic readings. Through his gestures of upcycling, he finds a vernacular of contradiction which oscillates between rational non-functionalism and irrational functionalism.\n\nFinn humorously references canonical designs of the minimalist art period. As in the case of “Donald Crudd”, he borrows Judd’s simplistic model, juxtaposing it with reclaimed material and ultimately puts the modernist form on trial.\n\nThrough his intuitive process of selection and assemblage, Finn leaves human impressions on that which is typically mass produced. The comfort and value found in these flawed objects brings home the precarious and catalytic nature of this artist’s lifestyle. They are his artifacts of lived experience, caught between crosswinds of desire and austerity.",
        "bio":"Finn Stewart is a multidisciplinary designer and visual artist, currently working and residing in Melbourne (Naarm)– upon the unceded lands of the Eastern Kulin Nation. Finn works across graphics, animation, products, and environments, with the intent to create joyful and cohesive experiences for; arts & culture, public space, brands, events, and institutions.\n\nWith a tenacious passion for creativity, Finn dedicates himself to personal and collaborative projects that extend his conceptual and technical abilities. These projects include; architecture, fashion, garden design, interior design, VFX, photography, and sculpture.\n\nFinn’s expertise in; Illustrator, Photoshop, InDesign, Figma, and Blender, gives him the capacity to ideate identities with dialogues between 2D and 3D. Grounded by his diversified skillset and playful approach to uncovering possibilities, Finn is particularly suited to working in smaller design studios that value an eye for detail and lateral thinking.",
        "contact": "finnstewart@me.com"
      },
      {
        "id": 13,
        "name": "Jazelle Mackenzie",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 14,
        "name": "Jasmine Wang",
        "tags": ["poster", "layout"],
        "title": "Me & You Together (Song)",
        "image": "Press/jasmine1.jpeg",
        "image2":"Press/jasmine2.jpeg",
        "year": "2023",
        "desc": "A publication soundtracked to life and the sounds found around us.",
        "bio":"",
        "contact": "jasw6101@gmail.com"
      },
      {
        "id": 15,
        "name": "Juliette Rosa",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 16,
        "name": "Katya Vergana",
        "tags": ["print"],
        "title": "Grimm's Fairy Tales",
        "image": "Press/katya.jpg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "A book containing selected works from the Brother's Grimm collection of fairy tales with new original illustrations.",
        "bio":"",
        "contact": "s3872788@student.rmit.edu.au"
      },
      {
        "id": 17,
        "name": "Leon Li",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 18,
        "name": "Li Yeng Hui",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 19,
        "name": "Natalie Chen",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 20,
        "name": "Nicholas Gleeson",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 21,
        "name": "Paul Weedon",
        "tags": ["print"],
        "title": "Welcome to the Dream State",
        "image": "Press/paul.jpg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "This project is research towards a non linear story told through images from the language of dreams. It is presented as a speculative publication. I have combined personal experience and the visual vocabularies of painters, writers and myth-makers in an attempt to create an artefact which reflects the dream state in an authentic way. Our dreams are personal, but are they unique? Can I describe a syntax or language that is shared, recognisable and self evident?",
        "bio":"",
        "contact": "paulweedon3000@gmail.com"
      },
      {
        "id": 22,
        "name": "Raquel Laing-Nobrega",
        "tags": ["print", "layout"],
        "title": "Slice",
        "image": "Press/raquel.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "‘Slice’ is an illustrative zine showcasing quotes from a diary I kept in high school, displaying them alongside graphics in a comic-style format. This zine publication translates the incoherent ramblings of a troubled teen into visual information in a comedic and entertaining way.\n\nActing as a strong expression of self, I intend to express my own individualism by vocalizing my experiences. The zine is bound by a saddle-stitched, A5 in size and 24 pages long. Each quote is accompanied by a satirical illustration, printed with a Risograph printer to produce vibrant colours.",
        "bio":"",
        "contact": "s3899883@student.rmit.edu.au"
      },
      {
        "id": 23,
        "name": "Rio Muniandy",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },

      {
        "id": 24,
        "name": "Sophie Jones",
        "tags": ["poster", "layout"],
        "title": "Kind Regards",
        "image": "Press/sophie.jpeg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "The brand identity and web shopfront of Kind Regards, an online print store; Accompanied by four prints carried by the store.",
        "bio":"Sophie is a Melbourne based Visual Communication Designer.\n\nWith a special interest in Identity Design, her application skills transcend Digital, Print, Merchandise and Packaging design. ",
        "contact": "hello@sophiejones.design"
      },
      {
        "id": 25,
        "name": "Sum Tsui",
        "tags": ["identity", "logo"],
        "title": "'Being Human' Exhibition Proposal and Design ",
        "image": "Press/sum.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "“Being Human” is a speculative exhibition proposal and design for NGV. It features a toolbox of visual elements that can be applied to a broad range of promotional materials. It also includes a basic plan of the visitor’s experience in the exhibition.\n\n“Being Human” is an art and design exhibition that explores the multifaceted meaning of what it means to be human.\n\nBy presenting an array of art and design works, it invites the audience to reflect on their past and present choices, needs, and wants, and think about how they would like to proceed and possibly live differently in the future. Ultimately, the exhibition aims to empower the audience to be brave and live the life they want.",
        "bio":"",
        "contact": "s3862892@student.rmit.edu.au"
      },
      {
        "id": 26,
        "name": "Teresa Si Pei Wee",
        "tags": [""],
        "title": "Growing Through Grief",
        "image": "Press/teresa.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "Grief can leave people devastated and unable to reach out for help. People experiencing grief can appear stuck or numb much like bring trapped in an invisible box. They are often overwhelmed by the situation they find themselves in and unable to function like they used to and coordinate the care they desperately need. This exhibition is a way to reach out and break down the invisible barriers of loss and the things people don’t talk about.To encourage people that are suffering from grief to share about their loss, heal through conversations, and take a step into a positive perspective moving forward.",
        "bio":"",
        "contact": "s3735467@student.rmit.edu.au"
      },
      {
        "id": 27,
        "name": "Vinson Liang",
        "tags": ["print", "layout"],
        "title": "Chinese Motifs",
        "image": "Press/rongshen.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "My work explores the intersection of traditional Chinese motifs and modern aesthetics, reflecting my deep-rooted appreciation for history and passion for innovation. Inspired by the philosophies of Buddhism, Taoism, and Confucianism, I strive to encapsulate their essence in my designs, creating a dialogue between the ancient and contemporary. With each piece, I embark on a journey of self-discovery, seeking to understand my identity and heritage better, while sharing the beauty of Chinese culture with the world. This book is a testament to that journey and an invitation to join me in exploring these captivating motifs.",
        "bio":"",
        "contact": "s3815174@student.rmit.edu.au"
      },
      {
        "id": 28,
        "name": "William Hunt",
        "tags": ["logo"],
        "title": "AI Designed Helmet Making",
        "image": "Press/william.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "This project was about discovering how AI generated images could be used in my own design process, with a final output of a painted racing helmet.",
        "bio":"",
        "contact": "s3873473@student.rmit.edu.au"
      },
      {
        "id": 29,
        "name": "Xinyuan Du",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 30,
        "name": "Xin Yin",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 31,
        "name": "Yidi Wang",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },

      {
        "id": 32,
        "name": "Zixin Liu Alexis",
        "tags": ["identity"],
        "title": "Wine Brand Item Design",
        "image": "Press/zixin.jpg",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "Two promotional items are designed for the tea brand.\n\nSample of tea: Logos on the cover and tea tags can help customers identify the brand quickly. Free tea samples can be customised to the tea brand's preferences to promote the business.\n\nTeacup: Teacups can be given as product giveaways to customers who buy tea from the brand. The logo and unique selling proposition should be designed to appeal to customers and placed under the cup to promote the business effectively.",
        "bio":"",
        "contact": "s3637309@student.rmit.edu.au"      
      },

      {
        "id": 33,
        "name": "Zoe White",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 34,
        "name": "Zoe Zhou",
        "tags": [""],
        "title": "Untitled",
        "image": "Press/placeholder.png",
        "image2":"Press/no-img.jpg",
        "year": "2023",
        "desc": "",
        "bio":"",
        "contact": ""
      },
      {
        "id": 35,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/1.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 36,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/2.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 37,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/3.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 38,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/4.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 39,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/5.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 40,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/6.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 41,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/7.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 42,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/8.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 43,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/9.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 44,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/10.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 45,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/10.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 46,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/12.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 47,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/13.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 48,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/14.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 49,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/15.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 50,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/16.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 51,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/17.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 52,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/18.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 53,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/19.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 54,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/20.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 55,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/21.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 56,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/22.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 57,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/23.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 58,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/24.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 59,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/25.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 60,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/26.png",
        "year": "",
        "desc": ""
      },
      {
        "id": 61,
        "name": "sys",
        "tags": [""],
        "title": "",
        "image": "Random/27.png",
        "year": "",
        "desc": ""
      }
    ]
  }